app/controllers/school_classes_controller.rb

  def index
    @school_classes = SchoolClass.all
---
SELECT "school_classes".* FROM "school_classes"

  def create
    @school_class = SchoolClass.create(school_class_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Math 201"], ["room_number", 215], ["created_at", "2020-12-22 02:09:09.484873"], ["updated_at", "2020-12-22 02:09:09.484873"]]

  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(school_class_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Math 201"], ["room_number", 102], ["updated_at", "2020-12-22 02:15:35.968410"], ["id", 9]]