app/controllers/students_controller.rb

  def create
    @student = Student.create(student_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "David"], ["last_name", "Forester"], ["created_at", "2020-12-21 22:39:19.182686"], ["updated_at", "2020-12-21 22:39:19.182686"]]

  def update
    @student = Student.find(params[:id])
    @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Ed"], ["last_name", "Smithers"], ["updated_at", "2020-12-21 22:36:44.206813"], ["id", 7]]